# Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
values = ["julio","julia","rafael", "pandas", "python"]

In [3]:
size = len(values)
indexes = range(size)

In [4]:
dicts = {x:v for i,x  in enumerate(indexes)
             for v in values
        if v == values[i]}
dicts

{0: 'julio', 1: 'julia', 2: 'rafael', 3: 'pandas', 4: 'python'}

### build series are similiar to dicts, the have index that can be seted

In [5]:
series = pd.Series(data=values, index=indexes)
series

0     julio
1     julia
2    rafael
3    pandas
4    python
dtype: object

In [6]:
series = pd.Series(values, indexes)
series

0     julio
1     julia
2    rafael
3    pandas
4    python
dtype: object

In [7]:
series_idx_default = pd.Series(values)
series_idx_default

0     julio
1     julia
2    rafael
3    pandas
4    python
dtype: object

In [8]:
np_arr = np.array(values)
np_arr

array(['julio', 'julia', 'rafael', 'pandas', 'python'], dtype='<U6')

In [9]:
series_from_np_array = pd.Series(np_arr)
series_from_np_array

0     julio
1     julia
2    rafael
3    pandas
4    python
dtype: object

In [10]:
series_from_dict = pd.Series(dicts)
series_from_dict

0     julio
1     julia
2    rafael
3    pandas
4    python
dtype: object

### series can hold functions

In [11]:
def my_power (x,y): 
    return x**y

pd.Series(data=[sum, print, len, my_power])

0                  <built-in function sum>
1                <built-in function print>
2                  <built-in function len>
3    <function my_power at 0x7f2e8bafd7b8>
dtype: object

# DataFrames

In [12]:
from numpy.random import randn
np.random.seed(101)

In [13]:
df = pd.DataFrame(data=randn(5,4), index=['A','B', 'C','D', 'E'], columns=['AZ','SX','DC','FV'])
df

         AZ        SX        DC        FV
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
col = df['AZ']
col

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: AZ, dtype: float64

In [15]:
type(col)

pandas.core.series.Series

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df.SX # dot notation to access columns

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: SX, dtype: float64

In [18]:
df['SX'] # same as defore

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: SX, dtype: float64

In [19]:
df[['AZ','DC']] #multiple columns

         AZ        DC
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [20]:
df['Θ'] = df['AZ'] + df['DC'] #creating new column

In [21]:
df['β'] = df['Θ'] * df['AZ'] #creating new column
df

         AZ        SX        DC        FV         Θ         β
A  2.706850  0.628133  0.907969  0.503826  3.614819  9.784773
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959 -0.128244
C -2.018168  0.740122  0.528813 -0.589001 -1.489355  3.005768
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542 -0.140492
E  0.190794  1.978757  2.605967  0.683509  2.796762  0.533606

In [22]:
df.drop('β', axis=1) # droping column

         AZ        SX        DC        FV         Θ
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [23]:
# was not assingned
df

         AZ        SX        DC        FV         Θ         β
A  2.706850  0.628133  0.907969  0.503826  3.614819  9.784773
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959 -0.128244
C -2.018168  0.740122  0.528813 -0.589001 -1.489355  3.005768
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542 -0.140492
E  0.190794  1.978757  2.605967  0.683509  2.796762  0.533606

In [24]:
df.drop('β', axis=1, inplace=True) # droping column putting value inplace
df

         AZ        SX        DC        FV         Θ
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [25]:
df.drop('D', axis=0) #dropping line

         AZ        SX        DC        FV         Θ
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [26]:
df.shape

(5, 5)

### selecting rows

In [27]:
df.loc['B'] # as columns lines are series

AZ    0.651118
SX   -0.319318
DC   -0.848077
FV    0.605965
Θ    -0.196959
Name: B, dtype: float64

In [28]:
df.iloc[1] #by numerical index

AZ    0.651118
SX   -0.319318
DC   -0.848077
FV    0.605965
Θ    -0.196959
Name: B, dtype: float64

In [29]:
df.loc['A','SX'] #value in line A and Column SX

0.6281327087844596

In [30]:
df.loc[['A','C','E']] #subset of lines

         AZ        SX        DC        FV         Θ
A  2.706850  0.628133  0.907969  0.503826  3.614819
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [31]:
df.loc[['A','C','E'],['SX','Θ']] #subset of lines and columns

         SX         Θ
A  0.628133  3.614819
C  0.740122 -1.489355
E  1.978757  2.796762

## DataFrame conditional selection

In [35]:
boolDf = df < 0
boolDf

      AZ     SX     DC     FV      Θ
A  False  False  False  False  False
B  False   True   True  False   True
C   True  False  False   True   True
D  False   True   True  False   True
E  False  False  False  False  False

In [36]:
df[boolDf]

         AZ        SX        DC        FV         Θ
A       NaN       NaN       NaN       NaN       NaN
B       NaN -0.319318 -0.848077       NaN -0.196959
C -2.018168       NaN       NaN -0.589001 -1.489355
D       NaN -0.758872 -0.933237       NaN -0.744542
E       NaN       NaN       NaN       NaN       NaN

In [37]:
df[df > 0]

         AZ        SX        DC        FV         Θ
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057       NaN
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [38]:
df[df['AZ']>0] #only the lines without values < 1 in column W

         AZ        SX        DC        FV         Θ
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [39]:
df[df['SX']<0]

         AZ        SX        DC        FV         Θ
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542

In [40]:
df[(df['AZ']>0) & (df['DC']>1)]# for multiple conditions do not use 'and' insted use &

         AZ        SX        DC        FV         Θ
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [41]:
df[(df['SX']>0) | (df['DC']>1)]

         AZ        SX        DC        FV         Θ
A  2.706850  0.628133  0.907969  0.503826  3.614819
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
E  0.190794  1.978757  2.605967  0.683509  2.796762

## DataFrames Index

In [42]:
df.reset_index() # nothing passed the original index turns into a column

  index        AZ        SX        DC        FV         Θ
0     A  2.706850  0.628133  0.907969  0.503826  3.614819
1     B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
2     C -2.018168  0.740122  0.528813 -0.589001 -1.489355
3     D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
4     E  0.190794  1.978757  2.605967  0.683509  2.796762

In [43]:
df.reset_index(drop=True) #now the column index is gone

         AZ        SX        DC        FV         Θ
0  2.706850  0.628133  0.907969  0.503826  3.614819
1  0.651118 -0.319318 -0.848077  0.605965 -0.196959
2 -2.018168  0.740122  0.528813 -0.589001 -1.489355
3  0.188695 -0.758872 -0.933237  0.955057 -0.744542
4  0.190794  1.978757  2.605967  0.683509  2.796762

In [44]:
new_indexes = "AA BB CC DD EE".split()
new_indexes

['AA', 'BB', 'CC', 'DD', 'EE']

In [45]:
df['2X'] = new_indexes
df

         AZ        SX        DC        FV         Θ  2X
A  2.706850  0.628133  0.907969  0.503826  3.614819  AA
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959  BB
C -2.018168  0.740122  0.528813 -0.589001 -1.489355  CC
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542  DD
E  0.190794  1.978757  2.605967  0.683509  2.796762  EE

In [46]:
df.set_index('2X')

          AZ        SX        DC        FV         Θ
2X
AA  2.706850  0.628133  0.907969  0.503826  3.614819
BB  0.651118 -0.319318 -0.848077  0.605965 -0.196959
CC -2.018168  0.740122  0.528813 -0.589001 -1.489355
DD  0.188695 -0.758872 -0.933237  0.955057 -0.744542
EE  0.190794  1.978757  2.605967  0.683509  2.796762

In [47]:
df.reset_index(drop=True).set_index('2X').rename_axis('')

          AZ        SX        DC        FV         Θ

AA  2.706850  0.628133  0.907969  0.503826  3.614819
BB  0.651118 -0.319318 -0.848077  0.605965 -0.196959
CC -2.018168  0.740122  0.528813 -0.589001 -1.489355
DD  0.188695 -0.758872 -0.933237  0.955057 -0.744542
EE  0.190794  1.978757  2.605967  0.683509  2.796762

# Multilevel index in DataFrames

In [112]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3]
hier_index = list(zip(outside,inside + inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [113]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [114]:
inside

[1, 2, 3]

In [115]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3)]

In [116]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [117]:
columns = ['A','B']
df = pd.DataFrame(randn(6,2), hier_index,columns)
df

             A         B
G1 1 -0.925874  1.862864
   2 -1.133817  0.610478
   3  0.386030  2.084019
G2 1 -0.376519  0.230336
   2  0.681209  1.035125
   3 -0.031160  1.939932

In [118]:
df.loc['G1']

          A         B
1 -0.925874  1.862864
2 -1.133817  0.610478
3  0.386030  2.084019

In [119]:
df.loc['G1'].loc[1]

A   -0.925874
B    1.862864
Name: 1, dtype: float64

In [120]:
df.index.names

FrozenList([None, None])

In [121]:
df.index.names = ['Groups','Nums']
df

                    A         B
Groups Nums
G1     1    -0.925874  1.862864
       2    -1.133817  0.610478
       3     0.386030  2.084019
G2     1    -0.376519  0.230336
       2     0.681209  1.035125
       3    -0.031160  1.939932

In [122]:
df.loc['G2'].loc[2]['B']

1.0351250747739213

In [126]:
for o in set(outside):
    for i in inside:
        for c in columns:
            value = df.loc[o].loc[i][c]
            print('index: ',o,i,' column: ',c,' the value is: ', value)

index:  G1 1  column:  A  the value is:  -0.92587425881
index:  G1 1  column:  B  the value is:  1.86286413849
index:  G1 2  column:  A  the value is:  -1.13381716158
index:  G1 2  column:  B  the value is:  0.610477907538
index:  G1 3  column:  A  the value is:  0.386030312114
index:  G1 3  column:  B  the value is:  2.08401853034
index:  G2 1  column:  A  the value is:  -0.376518675249
index:  G2 1  column:  B  the value is:  0.230336343592
index:  G2 2  column:  A  the value is:  0.681209292587
index:  G2 2  column:  B  the value is:  1.03512507477
index:  G2 3  column:  A  the value is:  -0.0311604814931
index:  G2 3  column:  B  the value is:  1.93993231099

In [127]:
df.xs('G1')

             A         B
Nums
1    -0.925874  1.862864
2    -1.133817  0.610478
3     0.386030  2.084019

In [129]:
df.xs(1,level='Nums')

               A         B
Groups
G1     -0.925874  1.862864
G2     -0.376519  0.230336

In [136]:
for o in set(outside):
    value = df.xs(o)
    print(value)
    for i in inside:
            value = df.xs(i,level='Nums')
            print(value)

             A         B
Nums
1    -0.925874  1.862864
2    -1.133817  0.610478
3     0.386030  2.084019
               A         B
Groups
G1     -0.925874  1.862864
G2     -0.376519  0.230336
               A         B
Groups
G1     -1.133817  0.610478
G2      0.681209  1.035125
              A         B
Groups
G1      0.38603  2.084019
G2     -0.03116  1.939932
             A         B
Nums
1    -0.376519  0.230336
2     0.681209  1.035125
3    -0.031160  1.939932
               A         B
Groups
G1     -0.925874  1.862864
G2     -0.376519  0.230336
               A         B
Groups
G1     -1.133817  0.610478
G2      0.681209  1.035125
              A         B
Groups
G1      0.38603  2.084019
G2     -0.03116  1.939932

# Missing Data

In [3]:
d = {'DS':[1,2, np.nan], 'ML':[5, np.nan, np.nan], 'DA':[1,2,3]}

In [4]:
df = pd.DataFrame(d)
df

   DA   DS   ML
0   1  1.0  5.0
1   2  2.0  NaN
2   3  NaN  NaN

In [5]:
df.dropna() #drop lines with NaN value

   DA   DS   ML
0   1  1.0  5.0

In [6]:
df.dropna(axis=1) #drop columns with NaN value

   DA
0   1
1   2
2   3

In [9]:
df.dropna(thresh=2)

   DA   DS   ML
0   1  1.0  5.0
1   2  2.0  NaN

In [10]:
df.fillna(value='not a NaN anymore')

   DA                 DS                 ML
0   1                  1                  5
1   2                  2  not a NaN anymore
2   3  not a NaN anymore  not a NaN anymore

In [12]:
df['DS'].fillna(value=df['DS'].mean()) #fill NaN in a column DS with it's mean value

0    1.0
1    2.0
2    1.5
Name: DS, dtype: float64

# GroupBy

In [13]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [14]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [15]:
byComp = df.groupby('Company')

In [16]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [17]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [18]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [21]:
df.groupby('Company').max().loc['FB']

Person    Sarah
Sales       350
Name: FB, dtype: object

In [22]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [23]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

# Mergin, Joining and Concatenating

In [26]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [27]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [28]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## Concatenation
Concatenation basically glues together DataFrames. Keep in mind that dimensions should match along the axis you are concatenating on. You can use pd.concat and pass in a list of DataFrames to concatenate together:

In [29]:
pd.concat([df1,df2,df3]) #by lines

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [30]:
pd.concat([df1,df2,df3],axis=1) #by columns

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

## Merging

The **merge** function allows you to merge DataFrames together using a similar logic as merging SQL Tables together. For example:

In [33]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [34]:
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})  
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [35]:
pd.merge(left,right,how='inner',on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [36]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [37]:
pd.merge(left, right, on=['key1', 'key2'])

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [38]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

In [39]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

In [40]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A2  B2   K1   K0   C2   D2
4  A3  B3   K2   K1  NaN  NaN

## Joining
Joining is a convenient method for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [41]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [42]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [43]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [44]:
left.join(right, how='left')

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [45]:
left.join(right, how='right')

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

# Operations

In [47]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [48]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Finding Unique Values

In [49]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [50]:
df['col2'].nunique()

3

In [52]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecting Data

In [53]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [56]:
df[(df['col1']<2) & (df['col2']>2)]

   col1  col2 col3
0     1   444  abc

### Functions Apply

In [58]:
df['col1'].sum()

10

In [59]:
def square(x):
    return x * x

In [60]:
df['col1'].apply(square)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [66]:
df['col1'].apply(lambda x : x * x)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [64]:
lSquare(10)

100

### Sorting

In [68]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

### Null values

In [69]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

### Pivot table

In [71]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [72]:
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data Input and Output

In [6]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [8]:
csv_output = 'my_csv_output'
df.to_csv(csv_output, index=False) # index false elimantes a column with the index in te put file

In [9]:
pd.read_csv(csv_output)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [11]:
df = pd.read_excel('Excel_Sample.xlsx', sheetname='Sheet1')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [12]:
df.to_excel('my_excel_file.xlsx', sheet_name='new sheet')

In [18]:
data_html = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html') #looks for a table in the html
type(data_html)

list

In [19]:
data_html[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","June 27, 2017"
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","June 1, 2017"
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","May 23, 2017"
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017","May 18, 2017"
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017","May 18, 2017"
5,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,"January 13, 2017","May 18, 2017"
6,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
7,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","June 1, 2017"
8,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
9,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
10,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","March 13, 2017"
11,Hometown National Bank,Longview,WA,35156,Twin City Bank,"October 2, 2015","April 13, 2016"
12,The Bank of Georgia,Peachtree City,GA,35259,Fidelity Bank,"October 2, 2015","October 24, 2016"
13,Premier Bank,Denver,CO,34112,"United Fidelity Bank, fsb","July 10, 2015","August 17, 2016"
14,Edgebrook Bank,Chicago,IL,57772,Republic Bank of Chicago,"May 8, 2015","July 12, 2016"
15,Doral Bank En Espanol,San Juan,PR,32102,Banco Popular de Puerto Rico,"February 27, 2015","May 13, 2015"
16,Capitol City Bank & Trust Company,Atlanta,GA,33938,First-Citizens Bank & Trust Company,"February 13, 2015","April 21, 2015"
17,Highland Community Bank,Chicago,IL,20290,"United Fidelity Bank, fsb","January 23, 2015","April 21, 2015"
18,First National Bank of Crestview,Crestview,FL,17557,First NBC Bank,"January 16, 2015","May 8, 2017"
19,Northern Star Bank,Mankato,MN,34983,BankVista,"December 19, 2014","January 6, 2016"
20,"Frontier Bank, FSB D/B/A El Paseo Bank",Palm Desert,CA,34738,"Bank of Southern California, N.A.","November 7, 2014","November 10, 2016"
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,"October 24, 2014","January 6, 2016"
22,NBRS Financial,Rising Sun,MD,4862,Howard Bank,"October 17, 2014","March 26, 2015"
23,"GreenChoice Bank, fsb",Chicago,IL,28462,"Providence Bank, LLC","July 25, 2014","December 12, 2016"
24,Eastside Commercial Bank,Conyers,GA,58125,Community & Southern Bank,"July 18, 2014","July 11, 2016"
25,The Freedom State Bank,Freedom,OK,12483,Alva State Bank & Trust Company,"June 27, 2014","March 25, 2016"
26,Valley Bank,Fort Lauderdale,FL,21793,"Landmark Bank, National Association","June 20, 2014","June 29, 2015"
27,Valley Bank,Moline,IL,10450,Great Southern Bank,"June 20, 2014","June 26, 2015"
28,Slavie Federal Savings Bank,Bel Air,MD,32368,"Bay Bank, FSB","May 30, 2014","December 12, 2016"
29,Columbia Savings Bank,Cincinnati,OH,32284,"United Fidelity Bank, fsb","May 23, 2014","November 10, 2016"
...,...,...,...,...,...,...,...
523,"ANB Financial, NA",Bentonville,AR,33901,Pulaski Bank and Trust Company,"May 9, 2008","August 28, 2012"
524,Hume Bank,Hume,MO,1971,Security Bank,"March 7, 2008","August 28, 2012"
525,Douglass National Bank,Kansas City,MO,24660,Liberty Bank and Trust Company,"January 25, 2008","October 26, 2012"
526,Miami Valley Bank,Lakeview,OH,16848,The Citizens Banking Company,"October 4, 2007","September 12, 2016"
527,NetBank,Alpharetta,GA,32575,ING DIRECT,"September 28, 2007","August 28, 2012"
528,Metropolitan Savings Bank,Pittsburgh,PA,35353,Allegheny Valley Bank of Pittsburgh,"February 2, 2007","October 27, 2010"
529,Bank of Ephraim,Ephraim,UT,1249,Far West Bank,"June 25, 2004","April 9, 2008"
530,Reliance Bank,White Plains,NY,26778,Union State Bank,"March 19, 2004","April 9, 2008"
531,Guaranty National Bank of Tallahassee,Tallahassee,FL,26838,Hancock Bank of Florida,"March 12, 2004","June 5, 2012"
532,Dollar Savings Bank,Newark,NJ,31330,No Acquirer,"February 14, 2004","April 9, 2008"
533,Pulaski Savings Bank,Philadelphia,PA,27203,Earthstar Bank,"November 14, 2003","July 22, 2005"
534,First National Bank of Blanchardville,Blanchardville,WI,11639,The Park Bank,"May 9, 2003","June 5, 2012"
535,Southern Pacific Bank,Torrance,CA,27094,Beal Bank,"February 7, 2003","October 20, 2008"
536,Farmers Bank of Cheneyville,Cheneyville,LA,16445,Sabine State Bank & Trust,"December 17, 2002","October 20, 2004"
537,Bank of Alamo,Alamo,TN,9961,No Acquirer,"November 8, 2002","March 18, 2005"
538,AmTrade International Bank En Espanol,Atlanta,GA,33784,No Acquirer,"September 30, 2002","September 11, 2006"
539,Universal Federal Savings Bank,Chicago,IL,29355,Chicago Community Bank,"June 27, 2002","April 9, 2008"
540,Connecticut Bank of Commerce,Stamford,CT,19183,Hudson United Bank,"June 26, 2002","February 14, 2012"
541,New Century Bank,Shelby Township,MI,34979,No Acquirer,"March 28, 2002","March 18, 2005"
542,Net 1st National Bank,Boca Raton,FL,26652,Bank Leumi USA,"March 1, 2002","April 9, 2008"
543,"NextBank, NA",Phoenix,AZ,22314,No Acquirer,"February 7, 2002","February 5, 2015"
544,Oakwood Deposit Bank Co.,Oakwood,OH,8966,The State Bank & Trust Company,"February 1, 2002","October 25, 2012"
545,Bank of Sierra Blanca,Sierra Blanca,TX,22002,The Security State Bank of Pecos,"January 18, 2002","November 6, 2003"
546,"Hamilton Bank, NA En Espanol",Miami,FL,24382,Israel Discount Bank of New York,"January 11, 2002","September 21, 2015"
547,Sinclair National Bank,Gravette,AR,34248,Delta Trust & Bank,"September 7, 2001","February 10, 2004"
548,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
549,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
550,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
551,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
552,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [21]:
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:')

In [22]:
df.to_sql('my_temp_table', engine)

In [23]:
sqldf = pd.read_sql('my_temp_table', con=engine)

In [24]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15